Revit 2027 API
FabricationPart.ServiceId Property
 The fabrication part service identifier. The service can only be changed to compatible services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ServiceId { get; set; }
Public Property ServiceId As Integer
	Get
	Set
public:
property int ServiceId {
	int get ();
	void set (int value);
}
member ServiceId : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property:
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace